common/models/Unit.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `user_unit` WHERE (`id`=892) AND (`status`=10)