pegawai/controllers/PegawaiController.php

    public function actionTpp()
    {
        $nip = Yii::$app->user->identity->NIP;

        if (Yii::$app->request->post()) {
            $month = Yii::$app->request->post('month');
            $year = Yii::$app->request->post('year');
            $ym = $year.'-'.$month;
        }
        else {
            $bulan = new \DateTime('first day of this month', new \DateTimeZone(TIMEZONE));
            $bulan->sub(new \DateInterval('P1M'));
            $ym = $bulan->format('Y-m');
        }

        $model = PrestasiPerilakuKerja::find()
            ->where(['DATE_FORMAT(bulan, "%Y-%m")'=>$ym, 'nip'=>$nip])
            ->all();
---
SELECT * FROM `prestasi_perilaku_kerja` WHERE (DATE_FORMAT(bulan, "%Y-%m")='2023-02') AND (`nip`='198311242020111001')