keuangan/controllers/LaporanController.php

SELECT * FROM `unit_kerja` WHERE `kode`='17'
---
    public function actionTppPajakPegawaiPerUnitKerja($unit)
    {
        if (Yii::$app->request->post()) {
            $month = Yii::$app->request->post('month');
            $year = Yii::$app->request->post('year');
            $ym = $year.'-'.$month;
        }
        else {
            $bulan = new \DateTime('first day of this month', new \DateTimeZone(TIMEZONE));
            $bulan->sub(new \DateInterval('P1M'));
            $ym = $bulan->format('Y-m');
        }

        $model = PrestasiPerilakuKerja::find()
            ->where(['unit_kerja'=>$unit])
            // ->andWhere(['status'=>1])
            ->andWhere(['DATE_FORMAT(bulan, "%Y-%m")'=>$ym])
            // ->innerJoinWith(['nip'])
            ->orderBy(['gol' => SORT_DESC])
            ->all();

        $unit = UnitKerja::find()
            ->where(['kode'=>$unit])
            ->one();